Revit 2017 API
AssetPropertyString Class
 Represents a property of string value.
Namespace: Autodesk.Revit.Utility
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Syntax
C#
public class AssetPropertyString : AssetProperty
Visual Basic
Public Class AssetPropertyString _
	Inherits AssetProperty
Visual C++
public ref class AssetPropertyString : public AssetProperty
Inheritance Hierarchy
System.Object
 Autodesk.Revit.Utility.AssetProperty
 Autodesk.Revit.Utility.AssetPropertyString
See Also
AssetPropertyString Members
Autodesk.Revit.Utility Namespace